#include <iostream>
using namespace std;

int main ()
{
    double p; //利润profit
    double r; //奖金reward

    cout << "请输入您的销售利润(仅支持数字)：";
    cin >> p;
    p/=10000; //单位换算

    if(p<=10) //利润<=10万元
    {
        r=p*0.1;
        cout << "您的奖金提成为：" << r << "万元" << endl;
    }
    else if(p>10 && p<=20) //10万<利润<=20万元
    {
        r=10*0.1+(p-10)*0.075;
        cout << "您的奖金提成为：" << r << "万元" << endl;
    }
    else if(p>20 && p<=40) //20万<利润<=40万元
    {
        r=(10*0.1+10*0.075)+(p-20)*0.05;
        cout << "您的奖金提成为：" << r << "万元" << endl;
    }
    else if(p>40 && p<=60) //40万<利润<=60万元
    {
        r=(10*0.1+10*0.075+20*0.05)+(p-40)*0.03;
        cout << "您的奖金提成为：" << r << "万元" << endl;
    }
    else if(p>60) //利润>60万元
    {
        r=(10*0.1+10*0.075+20*0.05+20*0.03)+(p-60)*0.015;
        cout << "您的奖金提成为：" << r << "万元" << endl;
    }
    else
    {
        cout << "您输入的参数有误" << endl;
    }
    
    return 0;
}